In [24]:
import pandas as pd
import numpy as np

df = pd.read_csv("income.csv")

In [25]:
df = pd.read_csv("income.csv" , names = ['Name' , 'Monthly_Income'] , skiprows = [0])

In [26]:
df

        Name  Monthly_Income
0        Rob            5000
1      Rafiq            6000
2       Nina            4000
3      Sofia            7500
4      Mohan            8000
5        Tao            7000
6  Elon Musk        10000000

In [27]:
df.describe()

       Monthly_Income
count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07

In [28]:
df.Monthly_Income.quantile(0.25)

5500.0

In [11]:
df

        Name  Montly_Income
0        Rob           5000
1      Rafiq           6000
2       Nina           4000
3      Sofia           7500
4      Mohan           8000
5        Tao           7000
6  Elon Musk       10000000

In [18]:
df.Monthly_Income.quantile(0.25)

5500.0

In [19]:
df.Monthly_Income.quantile(1)

10000000.0

In [21]:
percentile_99=df.Monthly_Income.quantile(0.99)
percentile_99

9400479.999999994

In [29]:
df_no_outlier = df[df.Monthly_Income<=percentile_99]

In [23]:
df_no_outlier
#the outlier is removed from the dataset

    Name  Monthly_Income
0    Rob            5000
1  Rafiq            6000
2   Nina            4000
3  Sofia            7500
4  Mohan            8000
5    Tao            7000